# IsCurtainWall

## Description
Gets whether or not a wall is a curtain wall.

```pascal
FUNCTION IsCurtainWall(wall : HANDLE) : BOOLEAN;
```

```python

def vs.IsCurtainWall(wall):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|wall|HANDLE|The wall.|

## See Also
VS Functions:
SetIsCurtainWall

## Version
Availability: from Vectorworks 2014
## Category
* Objects - Walls